---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel.Get(Autodesk.Revit.DB.Element)
source: html/f13fa262-5cd2-8bf8-ca0f-ed6c4768c129.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel.Get Method

Returns an AlignmentStationLabel object for the given element.

## Syntax (C#)
```csharp
public static AlignmentStationLabel Get(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The element for which to return the object.